<template>
  <div class="flex flex-col gap-[80px] md:gap-[64px] text-[18px] md:text-[16px] font-light leading-[28px] md:leading-[24px] max-w-[900px] m-auto pb-[96px] md:pb-[64px] px-[16px]">
    <div class="flex flex-col gap-[16px]">
      <p>用户协议</p>
      <p>鉴于您的使用体验对我们至关重要，为确保您充分了解本产品的功能及明确您的权益义务，北京开放传神科技有限公司制定《开放传神用户协议》（以下简称“本协议”），并提示您：请务必认真阅读并全面理解本协议，在确保充分了解并同意相应条款后使用本产品。特别是责任提示条款，我们以加粗形式提醒您重点关注。一旦您收到本协议并开始使用本产品，将视为您已接受并认可本协议内容，协议即时生效。在阅读本协议过程中，如您对本协议或其中任意条款存在异议，请您立即停止使用本产品。</p>
      <p>我们高度重视公民个人隐私和信息安全，为此专门制定隐私政策以提供特殊保护，请您务必仔细阅读。若您未满18周岁，建议您的监护人一同阅读本协议（特别是“三、关于未成年人使用条款”），并在征得监护人同意后使用本产品或向我们提供相关信息。</p>
      <p>本协议签订地点为中华人民共和国北京市。</p>
      <p>本协议旨在为您阐述以下各项内容：</p>
      <p>一、协议条款详述</p>
      <p>二、用户行为守则</p>
      <p>三、关于未成年人使用条款</p>
      <p>四、出口管制约定</p>
      <p>五、知识产权及相关事项</p>
      <p>六、第三方软件或技术应用</p>
      <p>七、免责声明</p>
      <p>八、举报与投诉渠道说明</p>
      <p>九、争议解决及适用法律规定</p>
    </div>
    <div class="flex flex-col gap-[16px]">
      <p>一、本协议条款详述</p>
      <p>
        1.本协议仅针对您在本产品之数据、模型上传与下载，应用空间体验以及参与竞赛等活动，不包括第三方向您提供的服务。在使用第三方服务时，您应遵守相应用户协议及隐私政策或类似文件。对于任何第三方不当服务或违规行为，本产品不承担法律责任。</p>
      <p>关于您在本产品使用过程中的个人信息处理与保护问题，请您参阅我们制定的《隐私政策》相关内容。</p>
      <p>
        2.本协议一经发布即刻生效，我们保留根据法律法规、政策变动、公司经营策略调整及产品服务升级等情形随时对本协议进行修订或重订的权利。更新后的协议条款公布后，将自动替代原协议条款，您可随时在本产品查阅最新版协议条款。若您继续使用本产品，即视为接受更新后的条款。若您不同意协议的变动，请立即停止使用本产品。各软件下因具体使用的差异会有部分附加条款，一经使用即视为同意该条款。</p>
      <p>3.本协议中的各项条款均具有独立的法律效力，部分条款完全或部分无效或无法执行力时，不影响其他条款的效力。</p>
      <p>4.本协议中所列索引关键词仅用于协助您理解相应条款的主旨，不对本协议条款的含义或解释产生影响或限制。为确保您的自身权益，建议您详细阅读各条款的具体表述。</p>
    </div>
    <div class="flex flex-col gap-[16px]">
      <p>二、用户行为守则</p>
      <p>（一）用户注册</p>
      <p>1.用户在使用我们提供的模型、数据集等功能前，需注册并登录账号。在注册过程中，您需同意《用户协议》和《隐私政策》的条款，并按照页面提示完成注册。成功注册后，您将获得一个用户账户和相应的密码，需自行负责保管。您可采用账号和密码或手机号短信验证码的方式登录，请妥善保管验证码。您应对以个人用户账号实施的所有行为承担法律责任。</p>
      <p>2.为确保您更好地使用产品并保障账号安全，根据国家相关法律法规及政策规定，某些功能和/或某些单项服务项目可能需要您提供真实身份信息进行实名认证后方可使用。我们有权对您提供的资料进行合理审查，若您提供的信息包含不正确、不真实的内容，我们有权拒绝为您提供服务或终止已向您提供的服务。</p>
      <p>（二） 用户行为规范</p>
      <p>1.为确保本产品不受网络不法行为的影响，维护网络生态环境，您同意并承诺在未经相关权利人授权的情况下，不得利用本产品直接或间接实施以下行为：</p>
      <p>（1）侵入计算机信息系统；</p>
      <p>（2）采用技术手段，获取计算机信息系统中存储、处理或者传输的数据；</p>
      <p>（3）对计算机信息系统实施控制；</p>
      <p>（4）对计算机信息系统功能进行删除、修改、增加、干扰；</p>
      <p>（3）对计算机信息系统中存储、处理或者传输的数据和应用程序进行删除、修改、增加；</p>
      <p>（4）故意制作、传播计算机病毒等破坏性程序；</p>
      <p>（5）其他危害计算机信息网络安全或对互联网络正常运转产生负面影响的行为。</p>
      <p>2.为保证使用者在使用本产品过程中的个人账号安全等合法权益，您同意并承诺，未经我们允许或相关用户同意，禁止直接或间接实施以下行为：</p>
      <p>（1）自行导出其他用户在本产品上的信息；</p>
      <p>（2）向其他非原始用户显示、披露或提供其他原始用户的信息；</p>
      <p>（3）索要、窃取或以其他方式获取其他用户的传神社区账号、密码或其他身份验证信息；</p>
      <p>（4）未经授权冒充他人获取对本产品的访问权；</p>
      <p>（5）其他侵犯或企图侵犯用户正常使用本产品的行为。</p>
      <p>3.为使您更流畅及便利的使用本产品，维护产品的安全、稳定及正常运行，您同意并承诺在未经我们授权的情况下，不得直接或间接从事以下行为：</p>
      <p>（1）突破或避开本产品中的任何安全防护网、内容保护机制或数据度量工具等；</p>
      <p>（2）以任何方式影响我们在本产品中的数据处理、信息管理等权利；</p>
      <p>（3）通过反编译、逆向工程或以其他方式尝试获取本产品的源代码或后端服务的信息；</p>
      <p>（4）其他干扰或企图干扰本产品正常运行的行为。</p>
      <p>4.本产品中部分模型与功能运用了深度合成技术（具体页面中将予以明确标识），据此，我们针对您在使用相关模型与功能所生成的信息内容制定如下规定：</p>
      <p>（1）本协议所述制作的信息内容是指您使用本产品过程中所上传、复制、生成、存储、发布、传播的所有内容，包括但不限于账户头像、名称等账户信息以及您输入、回复、生成的文字、语音、图片、视频等信息内容。</p>
      <p>（2）您在本产品上的全部行为应符合法律法规及政策、社会公共秩序和道德风尚，如禁止反动、色情、暴力、冒犯、侮辱等不良信息内容的输入和生成。我们会依法采取技术或者人工方式对您的输入数据和合成结果进行审核，您注册账号下的一切行为由您自行完全负责。</p>
      <p>（3）您确保，您使用本产品制作的信息内容，是您所有或被相关权利人授权同意处理的信息，我们根据您的指令分析、处理该等信息内容以及生成新的信息内容不会侵犯任何第三方的合法权益（包括但不限于著作权、名誉权、财产权）。当您在本产品上的信息内容侵犯了第三方的合法权益而导致我们或/及我们的合作方遭受任何投诉、举报、索赔或诉讼，您有义务积极采取措施（包括但不限于积极举证回应、参与诉讼），以保证我们和我们的合作方免受或尽快摆脱该困境。当我们或/及我们的合作方因此遭受任何名誉、声誉或财产上的直接或间接损失时，您负有全部的损害赔偿责任。</p>
      <p>（4）您不得利用本产品编造、传播虚假信息。您在发布或传播利用本产品制作生成的非真实信息时，
      依法应当以显著方式予以标识（包括但不限于在生成图片中添加水印、附上非真实信息声明）。如您非法利用本产品编造、传播虚假信息的，我们会依法保存有关记录，并向网信部门和有关主管部门报告。</p>
      <p>5.对于您通过本产品发布、上传、链接或通过服务提供的任何内容，无论内容的形式如何，您同意对您所上传的内容承担责任。在法律允许的范围内，我们对您创建或上传的内容任何公开显示或使用不承担任何责任，但我们有权依照法律规定删除我们或有权的监管机构认为违反了任何法律或产品协议或政策的内容。</p>
      <p>6.若您在本产品所上传的模型涉及深度合成技术或利用相关模型自行开发应用、对外提供服务等，我们特别提醒您，您将作为技术支持者或服务提供者，您应严格遵守《中华人民共和国网络安全法》《中华人民共和国数据安全法》《中华人民共和国个人信息保护法》《互联网信息服务管理办法》《互联网信息服务深度合成管理规定》等法律、行政法规及规章制度，我们不承担相关模型所引发的任何法律责任和风险。</p>
      <p>7.当您违反本条款时，我们可根据具体情况对您实施警告、限制功能、暂停服务、封禁账号乃至关闭账户的处罚，并公告处理结果。针对危害国家安全、公共安全和国防利益的行为，我们将采取严厉措施。若因您违反相关规定导致其他用户、我们或我们的合作方遭受损失，您需自行承担全部法律责任，严重时甚至可能面临刑事责任。</p>
    </div>
    <div class="flex flex-col gap-[16px]">
      <p>三、关于未成年人使用条款</p>
      <p>1.如您尚未年满18周岁，为确保您在使用本产品时能够充分了解并遵守相关条款，您应在监护人的同意和指导下阅读并同意本协议，方可启用本产品。未成年用户在填写个人信息时，务必在监护人的指导下进行。</p>
      <p>2.未成年人用户及其监护人理解并确认，如因未成年人使用本产品导致的违反法律法规、本协议的行为，您及您的监护人应依照法律规定承担因此导致的全部法律责任。</p>
      <p>3.为确保未成年人隐私权益得到充分保障，我们强烈建议您在上传和发布涉及未成年人素材的信息内容时，务必谨慎对待。一旦完成上传和发布，即视为您已获得相关权利人的授权，并同意我们根据本协议对相关信息内容进行使用和处理。</p>
      <p>4.监护人特别注意事项</p>
      <p>监护人在未成年人的成长过程中扮演着至关重要的角色。被监护人需要被引导正确使用互联网产品，确保被监护人能够安全、合理地获取网络信息。同时，监护人还需要密切关注被监护人的身心健康，及时发现并干预被监护人沉迷网络的行为。</p>
      <p>此外，对于使用本产品的被监护人，监护人应该承担起指导和监督的责任，教育被监护人正确使用产品，避免被不良信息所影响。同时，如果被监护人申请注册产品账号，监护人应该认真审查其行为，确保被监护人的行为符合法律法规和道德规范。</p>
      <p>在使用本产品过程中，如您发现任何可能对未成年人身心健康产生不良影响的信息内容，或发现针对未成年人的侮辱、诽谤、威胁等网络欺凌行为，敬请通过“八、举报和投诉渠道”向我们举报，我们将迅速处理并给予反馈。</p>
    </div>
    <div class="flex flex-col gap-[16px]">
        <p>四、出口管制约定</p>
        <p>本产品，作为一项高科技产品，可能受到我国、美国及其他国家或地区的严格出口管制和限制。这些管制和限制，旨在确保国家安全、防止技术泄露以及维护国际秩序。这些规定和限制可能涉及多个方面，包括目的地、出口产品的内容和/或最终用户等。在使用本产品过程中，您必须严格遵守我国的出口管制法律法规以及国际出口法律法规，确保您的行为符合相关法规的规定。</p>
        <p>在使用本产品前，了解并遵守相关法规的规定至关重要。违反这些法规可能会导致严重的法律后果，包括罚款、监禁甚至更严重的惩罚。因此，作为本产品的用户，您同意并表示已经充分了解并遵守我国的出口管制法律法规以及国际出口法律法规。</p>
    </div>
    <div class="flex flex-col gap-[16px]">
      <p>五、知识产权及相关事项</p>
      <p>1.对于本产品提供的服务、功能和内容，包括但不限于软件、代码、模型、数据、文件、更新、商号、商标、服务标记、标识、域名（统称为“OpenCSG知识产权”），我们拥有对OpenCSG知识产权及其中所含的全部权利和所有权。</p>
      <p>2.对于用户利用本产品部分模型和功能的AI技术深度加工和处理生成的文字、图片、音频、视频等内容，其所有权和相关权益均由我们和法定权利人所有。我们作为技术提供者和法定权利人，有权对使用这些内容的行为进行监管和管理，以确保其合法、合规和安全地使用。同时，我们也鼓励用户在使用这些内容时，遵守相关法律法规和规定，尊重他人的知识产权和合法权益。</p>
      <p>3.您同意并承诺您上传、访问或获取之内容中所涵盖的知识产权。在未获得相关内容权益人预先同意的情况下，您不得使用、复制、修改、翻译、发布、广播、传输、分发、销售或以其他方式利用任何非您拥有的内容，同时，您不应试图规避防止未经授权复制或分发内容的措施。否则，本网站或内容所有者有权暂停您访问相关内容，并可能对您的侵权行为追究责任。</p>
      <p>4. 根据本产品的要求，您可在数据集中上传您的数据、模型，以及在应用空间体验中输入文字、图片、音频、视频等内容信息。您应充分理解和同意以下承诺：</p>
      <p>（1）根据页面要求如实填写上传数据和模型相关信息（包括但不限于所有者、许可证、公开状态），确保您已获得数据和模型所有权人及其他权益人的授权，遵守开源协议，您的上传行为不会侵犯任何主体的合法权益。</p>
      <p>（2）您所上传的模型所使用的训练和开发数据均已获得原所有权人和其他权利人许可，遵守了开源协议，该数据用以您上传模型的训练和开发不存在不正当竞争等侵犯任何主体合法权益的情形。</p>
      <p>（3）您在体验本产品部分模型和功能时所输入的文字、图片、音频、视频等内容信息，均已获得了原所有权人和其他权利人同意，您的输入行为不会侵犯任何主体的合法权益。</p>
      <p>5.作为本平台贡献者，您确认并向网站声明，对于您提交的任何内容，鉴于第三方可能进行免费下载或其他形式的使用，您自愿无偿地向本网站授予永久性、全球范围、非独占、无需支付许可费且不可撤销的知识产权许可及分许可。据此，本网站有权以复制、展示、执行、转授权、发布或其他任何方式使用、修改您的贡献内容以及相应衍生作品。</p>
      <p>6.若某一实体针对您或其他实体发起知识产权诉讼（包括诉讼中的交叉请求或反诉），主张您的贡献内容（或您参与创作的作品）涉及直接或间接的专利侵权，那么本协议针对该贡献内容或作品向该实体授予的许可应在起诉之日终止。您确保自己具备法定权利以授予上述许可。</p>
      <p>7.任何未经书面同意及权利人许可的获取行为，均属违法行为。为确保您基于本产品的合法权益得到及时、有效的保障，您特此授权我们在发现您的合法权益（包括但不限于信息网络传播权、著作权等）可能受到侵害时，有权以公司自身名义或委托专业第三方机构代表您，针对涉嫌侵权的第三方采取法律手段进行维权。授权的维权手段包括但不限于侵权监控、发函警告、行政举报、提起诉讼、申请仲裁、移送侦查机关处理、调解、和解等。请注意，您对我们上述授权并不代表我们与您之间存在任何利益共享机制。</p>
      <p>8.您若违反上述条款，所产生的一切风险与法律责任应由您自行全额承担。我们无需就您的上述行为导致或间接导致的任何损害进行赔偿，亦无需向其他用户或任何第三方承担法律责任。在您的行为侵犯我们的合法权益时，我们有权要求您承担相应法律责任。</p>
      <p>9、权益维护</p>
      <p>（一）举报侵权人的流程</p>
      <p>1.我们高度重视知识产权保护，如您认为有传神社区用户利用本产品侵害您合法权益，且本产品上的或由产品链接的材料侵犯了您的知识产权，请您按照法律规定及时以书面方式向我们发送举报侵权的通知，该通知应至少包含以下内容：</p>
      <p>（1）为了能够及时维护您的权利，您需向我们提供权利人的真实身份信息，具体包括：权利人姓名（或名称）、身份证或护照复印件（对自然人）、单位登记证明复印件（对单位）、通信地址和联系方式（如电话号码、传真或电子邮件）；如您系受权利人授权委托处理该事宜，您还需提交您本人的真实身份信息（同权利人要求）以及授权委托材料，授权委托材料中请明确具体的授权内容。</p>
      <p>（2）权利人享有权利的权属证明材料，以便我们防止他人冒充，滥用您的权利。请您明确您主张被侵权的版权作品（或商标），如果举报涉及多个作品（或商标），请提供详细清单，并附上您对其享有权利的证明材料。</p>
      <p>（3）权利人要求采取必要措施的网络地址或者足以准确定位侵权内容的相关信息，以便我们能够尽快与涉嫌侵权方取得联系。如提供您举报的侵权内容的网络链接及其所在位置等。</p>
      <p>（4）权利人主张侵权的理由和初步证据，以便我们能够针对您的诉求妥善处理。请您充分准确说明您的权益如何受损，并请提供足以表明对方侵权的证明材料。</p>
      <p>（5）内容真实性声明，以便我们有效屏蔽虚假投诉，高效甄别您的真实投诉内容。请您在权利通知中加入如下声明并签名或盖章："本人保证，本通知中所述信息是充分、真实、准确的，我是所投诉内容的合法权利人，或，我已获授权，有权行使第（4）项中列明内容的权益。本人确认，在我举报的传神社区产品上可获取的内容侵犯了本人相应的合法权益。本人承诺，因该通知内容不实所引发的法律责任，由本人自行完全承担。”</p>
      <p>我们提醒您特别注意：依照法律规定，如果通知中的的内容不完全属实导致他人（包含我们在内）权益受损，权利通知提交者将承担由此引发的全部法律责任（包括但不限于赔偿他人损失的费用及律师费）。如果您尚不确定传神社区上可获取的内容是否侵犯了您的合法权益，我们建议您先咨询专业人士，以避免造成您财产等不必要损失。</p>
      <p>2.举报侵权通知的送达</p>
      <p>您可以将上述相关材料通过电子邮件发送至contact@opencsg.com</p>

      <p>（二）被举报侵权人的维护方式</p>
      <p>1.根据法律规定，我们在收到举报侵权人发出的侵权通知后，将会向被举报侵权人转送该通知并根据情况采取移除相关内容等必要措施，如您在收到该通知后发现举报内容不实，您的合法权益因此受损的，您有权向我们发送您不构成侵权的反通知，我们将依法及时处理。该反通知应至少包含以下内容：</p>
      <p>（1）被举报人的真实身份信息，具体包括：被举报人姓名（或名称）、身份证或护照复印件（对自然人）、单位登记证明复印件（对单位）、通信地址和联系方式（如电话号码、传真或电子邮件）；如您系受被举报人授权委托处理该事宜，您还需提交您本人的真实身份信息（同被举报人要求）以及授权委托材料，授权委托材料中请明确具体的授权内容。</p>
      <p>（2）被举报人要求取消必要措施的网络地址或者足以准确定位被举报侵权内容的相关信息，以便我们能够尽快与举报人取得联系。如提供您被举报侵权内容的网络链接及其所在位置等。</p>
      <p>（3）被举报人主张不构成侵权的理由和初步证据，以便我们能够针对您的诉求妥善处理。请您充分准确说明举报人的侵权举报不准确的理由，并请提供足以表明您不构成侵权的证明材料，如您对被举报内容享有的权属证明等。</p>
      <p>（4）内容真实性声明，以便我们有效屏蔽虚假维权，高效甄别您的真实维权内容。请您在反通知中加入如下声明并签名或盖章："本人保证，本反通知中所述信息是充分、真实、准确的，我是被投诉侵权内容的合法权利人，或，我已获授权，有权行使第（3）、（4）项中列明内容的权益。本人确认，我被投诉举报的传神社区上可获取的内容未侵犯他人合法权益。本人承诺，因该反通知内容不实所引发的法律责任，由本人自行完全承担。”</p>
      <p>我们提醒您特别注意：依照法律规定，如果反通知中的的内容不完全属实导致他人（包含我们在内）权益受损，反通知提交者将承担由此引发的全部法律责任（包括但不限于赔偿他人损失的费用及律师费）。如果您尚不确定您是否侵权，我们建议您先咨询专业人士，以避免造成您财产等不必要损失。</p>
      <p>2.反通知的送达</p>
      <p>您可以将上述相关材料通过电子邮件发送至contact@opencsg.com</p>
    </div>
    <div class="flex flex-col gap-[16px]">
      <p>六、第三方软件或技术</p>
      <p>1.本产品可能会使用第三方软件或技术（包括可能使用的开源代码和公共领域代码等，下同），该使用已经获得合法授权。</p>
      <p>2.本产品如果使用了第三方的软件或技术，我们将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在本软件安装包特定文件夹中打包、或通过开源软件页面等形式进行展示，</p>
      <p>它们可能会以“软件使用许可协议”、“授权协议”、“开源代码许可证”或其他形式来表达。通过前述各种形式展现的相关协议、其他文件及网页，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，您应当遵守这些要求。如果您没有遵守这些要求，该第三方或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求我们给予协助，您应当自行承担法律责任。</p>
      <p>3. 就本产品所使用的第三方软件或技术所引发的任何纠纷，应由相关第三方负责解决，我方不承担相关责任。对于第三方软件或技术，我方不予提供客服支持，若需获取支持，请直接与第三方联系。</p>
    </div>
    <div class="flex flex-col gap-[16px]">
      <p>七、免责声明</p>
      <p>为确保您在使用本产品时充分了解相关权益，我们将明确告知您可能产生重大影响的相关事项，如您点击同意则表示已经完全理解并接受下述全部条款。</p>
      <p>1.在下列情形出现时，我们有权根据具体情况决定暂停或终止向您提供本产品，您需自行承担因此产生的全部损失：</p>
      <p>（1）违反法律、法规、政策及一切具有法律效力的规范；</p>
      <p>（2）违反本协议约定；</p>
      <p>（3）影响其他用户体验；</p>
      <p>（4）存在安全隐患；</p>
      <p>（5）违背我们的运营原则，或不符合我们其他管理要求的行为。</p>
      <p>2.鉴于当前科学技术的限制以及生成式人工智能的特性，我们在以下方面无法作出保证：</p>
      <p>（1）本产品上的数据、模型等满足您的使用要求和目的；</p>
      <p>（2）您经由本产品取得的任何产品、服务或其他材料符合您的期望；</p>
      <p>（3）本产品的稳定性、正常运行时间及可靠性，请不要对本产品和本产品中的所有信息内容产生任何依赖，我们将不对您或您的下游客户因您对本产品的依赖而造成的任何损害负责；</p>
      <p>（4）生成内容合规、准确和完整，且本产品上的模型（包括自有模型及第三方贡献者提供的模型）由用户直接或间接所生成内容并不代表我们的态度和观点。对于自有模型（不含第三方上传）运行基于法律法规允许的信息（包括但不限于公开互联网）积累，我们已采取自动和人工数据过滤措施，但仍不排除其中部分信息具有错误或会产生负面影响。如遇此情形，欢迎并感谢您按照本协议“八、举报和投诉渠道”释明的路径进行反映，我们将尽快处理。</p>
      <p>2.鉴于网络技术的特殊性，对于本产品变动风险，您表示理解并接受：产品需要定期或不定期地对提供网络服务的平台、相关的设备进行检修或者维护、进行系统及服务器配置、维护、升级，可能造成收费服务在合理时间内的中断，公司对此无需承担责任，但会尽可能事先进行通告。
      一经取消功能，您使用本产品的权益即刻终止，您在本产品中所储存的信息可能无法找回，公司无需对您或任何第三方承担相关责任。</p>
      <p>3.本文中的各项损失，包括但不限于利润、商业信誉、数据损毁以及其他有形或无形损害，我方无需承担任何直接或间接的赔偿或补偿责任，以下为部分列举事项：</p>
      <p>（1）使用或无法使用本产品；</p>
      <p>（2）使用经由本产品取得的任何产品、资料或服务；</p>
      <p>（3）您的信息内容遭到第三方未授权的使用或修改。</p>
      <p>（4）因第三方行为或不可抗力因素导致的损失；</p>
      <p>（5）因技术故障、网络中断、病毒或其他计算机问题导致的损失；</p>
      <p>（6)因误用我方产品或服务而导致的损失；</p>
      <p>（3）因未经授权访问或篡改数据导致的损失等。</p>
      <p>4.依据法律规定，对于非我方所能控制的其他风险，您应自行承担全部责任，包括但不限于；</p>
      <p>（1）由于不可抗力或者其他意外事件引起的数据丢失、泄漏等风险；</p>
      <p>（2）由于本产品与您的终端设备型号不相匹配，或您使用的网络信号差、带宽小等原因所导致的损害风险；</p>
      <p>（3）您的信息内容被他人盗用，或经传播后所引发的风险；</p>
      <p>（4）其他因不受我们控制因素所产生的任何风险。</p>
      <p>5. 在接获他人举报或投诉并确认您违反本协议或者存在其他违法违规的情况下，我们有权随时删除相关内容，并根据情节严重程度，对您实施警告、限制功能、暂停服务、封禁账号乃至关闭账户的处罚，并公告处理结果。若您的行为违反国家法律法规，我们将继续依法保存相关信息并报告有关部门。您应自行承担由此产生的一切法律责任，严重时您甚至可能面临刑事责任。</p>
      <p>6. 若您违反相关法律法规或本协议规定，导致我们遭受损失、遭受其他用户或任何第三方的索赔，或受到行政管理部门的处罚，您应全额赔偿我们、其他用户或相关第三方的实际损失，包括但不限于合理律师费用、差旅费等维权损失。</p>
      <p>7.您理解并同意，如果我们未执行或未行使包含在本协议中的（或我们在任何适用法律下有权享受的）任何法定权利或赔偿，不可视为对我们的权利的正式自动放弃，这些权利或救济仍对我们有效。我们于您过失或违约时放弃本协议规定的权利，也不视为其对您的其他或以后同类之过失或违约行为弃权。</p>
    </div>
    <div class="flex flex-col gap-[16px]">
      <p>八、举报和投诉渠道说明</p>
      <p>1.在以下情况下，任何人都有权向我们提出反映，我们将迅速予以受理、处理并反馈处理结果：</p>
      <p>（1）在使用本产品时发现的其他任何主体侵犯知识产权的行为；</p>
      <p>（2）在使用本产品时发现的其他任何主体违反法律法规的行为；</p>
      <p>（3）在使用本产品时发现的其他任何主体损害他人合法权益的行为；</p>
      <p>（4）在使用本产品时发现的其他任何主体其他需要处理的违规行为；</p>
      <p>（5）在使用本产品时发现的其他任何主体违反本文约定的行为；</p>
      <p>（6）您认为有必要向我们反映的其他问题。</p>
      <p>2.反映途径</p>
      <p>（1）联系邮箱：contact@opencsg.com</p>
      <p>（2）微信公众号：传神社区</p>
    </div>
    <div class="flex flex-col gap-[16px]">
      <p>九、争议解决和适用法律规定</p>
      <p>1.本协议的订立、执行和解释及争议的解决均应适用中国法律并受中国法院管辖。</p>
      <p>2.如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向公司注册地的人民法院提起诉讼。</p>
    </div>
  </div>
</template>