export const csghub = {
  "banner": {
    "headline1": "开源开放的",
    "headline2": "针对大模型原生设计的资产管理平台",
    "solution1": "为用户创造一个安全、高效且可信赖的环境，使其能够",
    "solution2": "更好的管理和运用大模型核心资产数据",
    "join": "加入社区"
  },
  "product": {
    "introduce": "产品介绍",
    "headline": "智能数据与AI管理平台",
    "desc1": "提供全面的解决方案，帮助您高效管理资产、开发AI应用、同步多源数据以及确保数据",
    "desc2": "安全合规。探索我们的功能，发现更多可能性，推动您的AI项目迈向成功",
    "part1": "全面的资产管理系统",
    "part1-": "高效管理模型库、数据集和代码等资产。支持大文件，提供Web端在线编辑功能，并可以预览数据集。通过资产元数据管理，使您的数据管理更有序、更高效",
    "p1": "模型库、数据集、代码等资产管理",
    "p2": "大文件支持",
    "p3": "Web 端在线编辑",
    "p4": "数据集预览",
    "p5": "资产元数据管理"
  },
  "starShip": {
    "headline": "OpenCSG StarShip 星舰平台",
    "desc": "StarShip 致力于为大模型应用开发团队提供一套完整的模型/数据管理及应用搭建平台，利用大模型技术打造软件工程2.0的新体验",
    "demo": "产品演示",
    "trailApply": "申请试用"
  },
}
