export const starShip = {
  title: '基于大模型的企业智能数字员工平台',
  desc: 'StarShip 由一系列能够独立完成复杂任务的 Copilot 组成，致力于提升软件研发流程各环节的效率，降低人力成本',
  use: '使用场景',
  section: {
    title: '基于软件研发流程的Copilot',
    desc: '涵盖代码生成、代码审查、代码问答、GitLab助手和数字员工管理驾驶舱全面提升开发效率、代码质量、问题解决能力和管理透明度，实现降本增效。',
    secTitle: '代码生成',
    secDesc:
      '代码生成功能通过需求理解、代码检索、编程计划和编写代码四个步骤完成实现，与主流 DevOps 流程完美融合，实现大模型与人类工程师的协同作业',
    secDetails: '四大步骤完成从需求到代码的实现：需求理解、代码检索、编程计划、编写代码',
    secDetails2: 'SWEBench Resolved 23.67%（🔗 swebench.com）',
    secDetails3: '与主流 DevOps 流程完美融合，实现大模型与人类工程师的协作',
    sec2Title: '代码审查',
    sec2Desc:
      '代码审查功能自动审阅代码变更、总结内容并提供修改建议，通过动态可配置的审查项进行全面评估，辅助审核者快速理解并给出评估分值和意见。',
    sec2Details: '自动审阅代码变更并给出修改建议',
    sec2Details2: '自动审阅代码变更内容，辅助审核者快速理解',
    sec2Details3: '全面评估，给出评估分和评估意见',
    sec2Details4: '动态可配置的代码审查项：语法错误、代码规范、接口问题等',
    sec3Title: '代码问答',
    sec3Desc:
      '代码问答功能提供基于代码仓库的多轮对话智能问答，帮助用户快速深入了解代码并提高编码效率。',
    sec3Details: '提供基于代码仓库的多轮对话智能问答功能',
    sec3Details2: '帮助用户快速深入了解代码，提高编码效率',
    sec4Title: 'GitLab助手',
    sec4Desc:
      '针对用户在使用GitLab过程中遇到的问题，提供专业的服务助手功能，给出针对性解决方案，帮助用户高效解决问题，提升使用体验。',
    sec5Title: '数字员工管理驾驶舱',
    sec5Desc:
      '数字员工管理驾驶舱通过可视化管理实现降本增效、掌控运行成本、确保工作质量和反馈一目了然。',
    sec5Details: '成效：降本增效，成效一目了然',
    sec5Details2: '省钱：运行成本了如指掌',
    sec5Details3: '放心：数字员工工作质量和评价反馈',
    sec5Details4: '可观测：运行过程可视化，工作成果可观测'
  },
  value: {
    title: 'StarShip 产品产品价值',
    desc: 'StarShip通过替代初级工程师、支持复杂项目和存量系统协作，贯穿完整的DevOps流程，实现任务驱动的研发需求解决方案，全面提升软件开发效率并节省成本。',
    vTitle: '企业数字员工平台',
    vDesc:
      '不同于LLM+IDE Plugin的方案，StarShip的目标不仅是提高编码阶段的效率, 而是替代各类初级工程师的人力。',
    v2Title: '支持复杂项目',
    v2Desc:
      'StarShip可以支持大型的复杂软件项目，而且可以在无人工干预的情况下独立完成指定的研发需求任务。',
    v3Title: '参与存量系统工作',
    v3Desc: 'StarShip支持与存量系统协作，能够很好的分析和理解已有代码仓库',
    v4Title: '支持DevOps完整流程',
    v4Desc: 'StarShip支持Dev，QA、Deploy等DevOps完整流程的角色定义，实现整个研发流程的降本增效。',
    v5Title: '任务驱动的工作过程',
    v5Desc:
      'StarShip通过“需求整理”、“代码搜索”和“编码计划”三个核心阶段实现解决研发需求的完整代码方案'
  }
}
