<template>
  <div class="pt-[96px] text-center w-full">
    <div class="max-w-[1280px] m-auto">
      <div class="flex flex-col items-center md:px-[20px] mb-[64px]">
        <div class="mb-[12px] border-[#3250BD] leading-[20px] text-[14px] text-[#223B99] border-[1.5px] rounded-[16px] py-[4px] px-[12px]">产品 #1</div>
        <div class="text-[36px] leading-[44px] text-[#101828]">OpenCSG StarCloud 星云平台</div>
        <div class="my-[20px] max-w-[768px] text-[20px] text-[#606266] leading-[30px] text-left font-light">StarCloud 是一个基于深度学习的一站式大模型开发及服务运行平台，提供完整的数据集管理、模型训练、评估和推理服务，特点包括便捷的发布方式、稳定的运行环境，以及企业级的服务安全，旨在支持各行业的生成式AI应用并帮助客户构建高精度、高性能的大模型。</div>
        <div class="flex gap-[16px] mb-[16px]">
          <div class="cursor-pointer py-[12px] px-[18px] flex text-[14px] leading-[20px] text-[#344054] gap-[6px] border border-[#D0D5DD] rounded-[8px]"><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none"><g clip-path="url(#clip0_661_4)"><path d="M9.99984 18.3337C14.6022 18.3337 18.3332 14.6027 18.3332 10.0003C18.3332 5.39795 14.6022 1.66699 9.99984 1.66699C5.39746 1.66699 1.6665 5.39795 1.6665 10.0003C1.6665 14.6027 5.39746 18.3337 9.99984 18.3337Z" stroke="#344054" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/><path d="M7.9165 7.47144C7.9165 7.0737 7.9165 6.87483 7.99962 6.76381C8.07206 6.66705 8.18293 6.60652 8.30349 6.59791C8.44182 6.58803 8.60911 6.69557 8.94368 6.91065L12.8775 9.43954C13.1678 9.62618 13.313 9.71949 13.3631 9.83815C13.4069 9.94183 13.4069 10.0588 13.3631 10.1625C13.313 10.2812 13.1678 10.3745 12.8775 10.5611L8.94368 13.09C8.60911 13.3051 8.44182 13.4126 8.30349 13.4027C8.18293 13.3941 8.07206 13.3336 7.99962 13.2368C7.9165 13.1258 7.9165 12.927 7.9165 12.5292V7.47144Z" stroke="#344054" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/></g><defs><clipPath id="clip0_661_4"><rect width="20" height="20" fill="white"/></clipPath></defs></svg>
            演示视频
          </div>
          <div class="cursor-pointer py-[12px] px-[18px] text-[14px] leading-[20px] text-[#FFF] bg-[#3250BD] border border-[#3250BD] rounded-[8px]">Demo体验</div>
        </div>
        <div class="text-[16px] leading-[24px] text-[#475467] font-light">联系销售获取演示账号</div>
      </div>
    </div>
  </div>
  <div class="w-full bg-white pb-[96px]">
    <div class="max-w-[1400px] m-auto mr-0">
      <div class="pl-[32px] lg:px-[32px] flex lg:flex-col gap-[64px] mb-[64px]">
        <div class="grid grid-cols-2 gap-[32px] py-[32px] w-[600px] lg:w-auto lg:grid-cols-1 items-start">
          <div class="flex flex-col items-start gap-[20px] md:px-[24px]">
            <div class="px-[12px] py-[12px] bg-[#3250BD] rounded-[10px]">
              <svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect x="4" y="4" width="48" height="48" rx="24" fill="#ACBDFF"/>
                <rect x="4" y="4" width="48" height="48" rx="24" stroke="#CED8FF" stroke-width="8"/>
                <path d="M25.75 36.7496L27.223 37.5679C27.5066 37.7255 27.6484 37.8043 27.7986 37.8351C27.9315 37.8625 28.0685 37.8625 28.2015 37.8351C28.3516 37.8043 28.4934 37.7255 28.777 37.5679L30.25 36.7496M21.25 34.2496L19.823 33.4568C19.5235 33.2904 19.3737 33.2072 19.2646 33.0889C19.1682 32.9842 19.0951 32.8601 19.0505 32.7249C19 32.5721 19 32.4008 19 32.0582V30.4996M19 25.4996V23.941C19 23.5984 19 23.4271 19.0505 23.2743C19.0951 23.1391 19.1682 23.015 19.2646 22.9103C19.3737 22.792 19.5234 22.7088 19.823 22.5424L21.25 21.7496M25.75 19.2496L27.223 18.4313C27.5066 18.2737 27.6484 18.1949 27.7986 18.1641C27.9315 18.1367 28.0685 18.1367 28.2015 18.1641C28.3516 18.1949 28.4934 18.2737 28.777 18.4313L30.25 19.2496M34.75 21.7496L36.177 22.5424C36.4766 22.7088 36.6263 22.792 36.7354 22.9103C36.8318 23.015 36.9049 23.1391 36.9495 23.2743C37 23.4271 37 23.5984 37 23.941V25.4996M37 30.4996V32.0582C37 32.4008 37 32.5721 36.9495 32.7249C36.9049 32.8601 36.8318 32.9842 36.7354 33.0889C36.6263 33.2072 36.4766 33.2904 36.177 33.4568L34.75 34.2496M25.75 26.7496L28 27.9996M28 27.9996L30.25 26.7496M28 27.9996V30.4996M19 22.9996L21.25 24.2496M34.75 24.2496L37 22.9996M28 35.4996V37.9996" stroke="#FCFCFD" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
            </div>
            <div>
              <div class="text-[18px] leading-[28px] text-[#101828] mb-[8px]">大模型训练和微调</div>
              <div class="text-[16px] leading-[24px] font-light text-[#475467]">StarCloud 平台的核心功能是大模型的训练和微调，允许用户查看训练状态并选择训练方式，同时支持企业客户根据业务需求对模型进行精调，使用专有数据集降低成本并优化特定任务的表现。</div>
            </div>
          </div>
          <div class="flex flex-col items-start gap-[20px] md:px-[24px]">
            <div class="px-[12px] py-[12px] bg-[#3250BD] rounded-[10px]">
              <svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect x="4" y="4" width="48" height="48" rx="24" fill="#ACBDFF"/>
                <rect x="4" y="4" width="48" height="48" rx="24" stroke="#CED8FF" stroke-width="8"/>
                <path d="M27 20.5H34.3C35.4201 20.5 35.9802 20.5 36.408 20.718C36.7843 20.9097 37.0903 21.2157 37.282 21.592C37.5 22.0198 37.5 22.5799 37.5 23.7V25C37.5 25.9319 37.5 26.3978 37.3478 26.7654C37.1448 27.2554 36.7554 27.6448 36.2654 27.8478C35.8978 28 35.4319 28 34.5 28M29 35.5H21.7C20.5799 35.5 20.0198 35.5 19.592 35.282C19.2157 35.0903 18.9097 34.7843 18.718 34.408C18.5 33.9802 18.5 33.4201 18.5 32.3V31C18.5 30.0681 18.5 29.6022 18.6522 29.2346C18.8552 28.7446 19.2446 28.3552 19.7346 28.1522C20.1022 28 20.5681 28 21.5 28M26.3 30.5H29.7C29.98 30.5 30.12 30.5 30.227 30.4455C30.3211 30.3976 30.3976 30.3211 30.4455 30.227C30.5 30.12 30.5 29.98 30.5 29.7V26.3C30.5 26.02 30.5 25.88 30.4455 25.773C30.3976 25.6789 30.3211 25.6024 30.227 25.5545C30.12 25.5 29.98 25.5 29.7 25.5H26.3C26.02 25.5 25.88 25.5 25.773 25.5545C25.6789 25.6024 25.6024 25.6789 25.5545 25.773C25.5 25.88 25.5 26.02 25.5 26.3V29.7C25.5 29.98 25.5 30.12 25.5545 30.227C25.6024 30.3211 25.6789 30.3976 25.773 30.4455C25.88 30.5 26.02 30.5 26.3 30.5ZM33.8 38H37.2C37.48 38 37.62 38 37.727 37.9455C37.8211 37.8976 37.8976 37.8211 37.9455 37.727C38 37.62 38 37.48 38 37.2V33.8C38 33.52 38 33.38 37.9455 33.273C37.8976 33.1789 37.8211 33.1024 37.727 33.0545C37.62 33 37.48 33 37.2 33H33.8C33.52 33 33.38 33 33.273 33.0545C33.1789 33.1024 33.1024 33.1789 33.0545 33.273C33 33.38 33 33.52 33 33.8V37.2C33 37.48 33 37.62 33.0545 37.727C33.1024 37.8211 33.1789 37.8976 33.273 37.9455C33.38 38 33.52 38 33.8 38ZM18.8 23H22.2C22.48 23 22.62 23 22.727 22.9455C22.8211 22.8976 22.8976 22.8211 22.9455 22.727C23 22.62 23 22.48 23 22.2V18.8C23 18.52 23 18.38 22.9455 18.273C22.8976 18.1789 22.8211 18.1024 22.727 18.0545C22.62 18 22.48 18 22.2 18H18.8C18.52 18 18.38 18 18.273 18.0545C18.1789 18.1024 18.1024 18.1789 18.0545 18.273C18 18.38 18 18.52 18 18.8V22.2C18 22.48 18 22.62 18.0545 22.727C18.1024 22.8211 18.1789 22.8976 18.273 22.9455C18.38 23 18.52 23 18.8 23Z" stroke="#FCFCFD" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
            </div>
            <div>
              <div class="text-[18px] leading-[28px] text-[#101828] mb-[8px]">流程完善、发布便捷</div>
              <div class="text-[16px] leading-[24px] font-light text-[#475467]">提供全流程服务：涵盖数据集管理、模型训练、服务发布与监管的一站式服务。可视化管理：通过直观的界面实现对大模型全生命周期的管理，简化从数据到服务的实施过程。</div>
            </div>
          </div>
          <div class="flex flex-col items-start gap-[20px] md:px-[24px]">
            <div class="px-[12px] py-[12px] bg-[#3250BD] rounded-[10px]">
              <svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect x="4" y="4" width="48" height="48" rx="24" fill="#ACBDFF"/>
                <rect x="4" y="4" width="48" height="48" rx="24" stroke="#CED8FF" stroke-width="8"/>
                <path d="M28 36.4722C29.0615 37.4223 30.4633 38 32 38C35.3137 38 38 35.3137 38 32C38 29.2331 36.1271 26.9036 33.5798 26.2102M22.4202 26.2102C19.8729 26.9036 18 29.2331 18 32C18 35.3137 20.6863 38 24 38C27.3137 38 30 35.3137 30 32C30 31.2195 29.851 30.4738 29.5798 29.7898M34 24C34 27.3137 31.3137 30 28 30C24.6863 30 22 27.3137 22 24C22 20.6863 24.6863 18 28 18C31.3137 18 34 20.6863 34 24Z" stroke="#FCFCFD" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
            </div>
            <div>
              <div class="text-[18px] leading-[28px] text-[#101828] mb-[8px]">运行稳定、共建生态</div>
              <div class="text-[16px] leading-[24px] font-light text-[#475467]">完整技术栈：平台提供完整的技术栈和长期稳定的模型开发引擎，确保算法的稳定性和性能。低技术门槛：适用于各行各业，降低接入门槛，助力完成行业大模型的开发建设。</div>
            </div>
          </div>
          <div class="flex flex-col items-start gap-[20px] md:px-[24px]">
            <div class="px-[12px] py-[12px] bg-[#3250BD] rounded-[10px]">
              <svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect x="4" y="4" width="48" height="48" rx="24" fill="#ACBDFF"/>
                <rect x="4" y="4" width="48" height="48" rx="24" stroke="#CED8FF" stroke-width="8"/>
                <path d="M29 23.5004L26 26.5004L30 28.5004L27 31.5004M36 28.0004C36 32.9088 30.646 36.4788 28.698 37.6152C28.4766 37.7444 28.3659 37.809 28.2097 37.8425C28.0884 37.8685 27.9116 37.8685 27.7903 37.8425C27.6341 37.809 27.5234 37.7444 27.302 37.6152C25.354 36.4788 20 32.9088 20 28.0004V23.218C20 22.4184 20 22.0187 20.1308 21.6751C20.2463 21.3715 20.434 21.1006 20.6777 20.8859C20.9535 20.6428 21.3278 20.5024 22.0764 20.2217L27.4382 18.211C27.6461 18.1331 27.75 18.0941 27.857 18.0786C27.9518 18.0649 28.0482 18.0649 28.143 18.0786C28.25 18.0941 28.3539 18.1331 28.5618 18.211L33.9236 20.2217C34.6722 20.5024 35.0465 20.6428 35.3223 20.8859C35.566 21.1006 35.7537 21.3715 35.8692 21.6751C36 22.0187 36 22.4184 36 23.218V28.0004Z" stroke="#FCFCFD" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
            </div>
            <div>
              <div class="text-[18px] leading-[28px] text-[#101828] mb-[8px]">安全可靠、一键启用</div>
              <div class="text-[16px] leading-[24px] font-light text-[#475467]">企业级服务：提供安全可信的企业级服务，结合底层内容安全功能，确保推理内容的审核与敏感词过滤。算法数据保护：采用企业级多租户设计，保护数据与安全隐私。</div>
            </div>
          </div>
        </div>
        <div class="bg-[#F2F4F7] w-[730px] h-[620px] rounded-l-[24px] lg:rounded-[24px] pr-0 xl:mt-[20px] lg:mt-0 mlg:w-auto mlg:px-[32px]"></div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  props: {},

  data() {
    return {};
  },

  components: {},

  mounted() {},
};
</script>
