export const product = {
  "banner": {
    "headline1": "從算力到應用",
    "headline2": "大模型引領軟件工程變革",
    "solution": "OpenCSG 解決方案"
  },
  "starCloud": {
    "headline": "OpenCSG StarCloud 星雲平台",
    "desc": "StarCloud 係一個基於深度學習嘅一站式大模型開發及服務運行平台，提供完整嘅數據集管理、模型訓練、評估同推理服務，特點包括便捷嘅發佈方式、穩定嘅運行環境，以及企業級嘅服務安全，旨在支持各行業嘅生成式AI應用並幫助客戶構建高精度、高性能嘅大模型。",
    "demoVideo": "演示影片",
    "demo": "Demo體驗",
    "remarks": "暫不開放註冊，請聯絡 {contact} 攞試用權限",
    "part1": "大模型訓練同微調",
    "part1-": "StarCloud 平台嘅核心功能係大模型嘅訓練同微調，允許用戶查看訓練狀態並選擇訓練方式，同時支持企業客戶根據業務需求對模型進行精調，使用專有數據集降低成本並優化特定任務嘅表現。",
    "part2": "流程完善、發佈便捷",
    "part2-": "提供全流程服務：涵蓋數據集管理、模型訓練、服務發佈與監管嘅一站式服務。可視化管理：通過直觀嘅介面實現對大模型全生命週期嘅管理，簡化從數據到服務嘅實施過程。",
    "part3": "運行穩定、共建生態",
    "part3-": "完整技術棧：平台提供完整嘅技術棧同長期穩定嘅模型開發引擎，確保算法嘅穩定性同性能。低技術門檻：適用於各行各業，降低接入嘅門檻，助力完成行業大模型嘅開發建設。",
    "part4": "安全可靠、一鍵啟用",
    "part4-": "企業級服務：提供安全可信嘅企業級服務，結合底層內容安全功能，確保推理內容嘅審核與敏感詞過濾。算法數據保護：採用企業級多租戶設計，保護數據與安全隱私",
  },
  "starShip": {
    "headline": "OpenCSG StarShip 星艦平台",
    "desc": "StarShip 致力於為大模型應用開發團隊提供一套完整嘅模型/數據管理及應用搭建平台，利用大模型技術打造軟件工程2.0嘅新體驗",
    "demo": "產品演示",
    "trailApply": "申請試用",
    "ideApply": "IDE 插件"
  },
}